case_files/stableWedge/domain/constant/dynamicMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1806                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      dynamicMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

motionSolverLibs    ("libsixDoFRigidBodyMotion.so");

dynamicFvMesh       dynamicOversetFvMesh;

dynamicOversetFvMeshCoeffs
{
}

solver          sixDoFRigidBodyMotion;

sixDoFRigidBodyMotionCoeffs
{

    patches         (floatingObject);
    innerDistance   100.0;
    outerDistance   101.0;

    centreOfMass    (0 0.025 0.383984);

    // Cuboid dimensions
    

    // Density of the solid
    rhoSolid        999;

    // Cuboid mass
    mass            #calc "0.006682*$rhoSolid";

    // Cuboid moment of inertia about the centre of mass
    momentOfInertia (0.000239699 0.000125825 0.00011666);
    velocity (0 0 0);
    report          on;
    accelerationRelaxation 0.6;

    solver
    {
        type Newmark;
    }

    constraints
    {

        
        /*fixedPoint
        {
             sixDoFRigidBodyMotionConstraint point;
             centreOfRotation (0.5 0.45 0.1);
        }*/
        

        /*fixedLine
        {
            sixDoFRigidBodyMotionConstraint line;
            //centreOfRotation (0.5 0.45 0.1);
            direction (0 0 1);
        }*/

        
        /*fixedAxis
        {
            sixDoFRigidBodyMotionConstraint axis;
            axis (0 1 0);
        }*/
	arrestRotation
 	{
	    sixDoFRigidBodyMotionConstraint   orientation;
   	
 	}
	/*fixedPlane
	{
	    sixDoFRigidBodyMotionConstraint plane;
	    normal	(0 1 0);	
	}*/


        
    }
}

// ************************************************************************* //
